Autodesk.Revit.DB.AssemblyInstance.RemoveMemberIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Removes member element ids from the assembly instance.
memberIds:
Element ids to be removed from the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be removed from the assembly instance.
Provided set should not be empty and all elements should be a member of the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.AddMemberIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Adds member element ids for the assembly instance.
memberIds:
Element ids to be added to the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for membership in the assembly instance.
Elements should be of a valid category and should not be a member of an existing assembly.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012